2.Problem Statement

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [5]:
import pandas as pd
import numpy as np

In [7]:
data = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis',  'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [8]:
data.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).**

In [9]:
data['FlightNumber'].fillna(value=df['FlightNumber'][0]+10, limit=1, inplace=True)
data['FlightNumber'].fillna(value=df['FlightNumber'][2]+10, limit=1, inplace=True)

In [10]:
data.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
data['FlightNumber'].dtype

dtype('float64')

In [13]:
data['FlightNumber'] = data['FlightNumber'].astype(np.int64)
data['FlightNumber'].dtype

dtype('int64')

In [14]:
data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The FromTo column would be better as two separate columns! Split each string on the underscore delimiter to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [15]:
temp_data = pd.DataFrame(data['From_To'].str.split('_', 1).to_list(), columns = ['From','To'])
temp_data

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [16]:
temp_data['From'] = temp_data['From'].str.capitalize()
temp_data['To'] = temp_data['To'].str.capitalize()
temp_data

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [17]:
data.drop(['From_To'], inplace=True, axis=1)
data

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [18]:
data = pd.concat([temp_data, df], axis=1, sort=False)
data

       From         To  ...  RecentDelays              Airline
0    London      Paris  ...      [23, 47]               KLM(!)
1    Madrid      Milan  ...            []    <Air France> (12)
2    London  Stockholm  ...  [24, 43, 87]  (British Airways. )
3  Budapest      Paris  ...          [13]       12. Air France
4  Brussels     London  ...      [67, 32]          "Swiss Air"

[5 rows x 6 columns]

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [20]:
delays = pd.DataFrame(data['RecentDelays'].to_list(), columns = ['delay_1', 'delay_2', 'delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [21]:
data.drop(['RecentDelays'], inplace=True, axis=1)
data

       From         To           From_To  FlightNumber              Airline
0    London      Paris      LoNDon_paris       10045.0               KLM(!)
1    Madrid      Milan      MAdrid_miLAN           NaN    <Air France> (12)
2    London  Stockholm  londON_StockhOlm       10065.0  (British Airways. )
3  Budapest      Paris    Budapest_PaRis           NaN       12. Air France
4  Brussels     London   Brussels_londOn       10085.0          "Swiss Air"

In [22]:
data.insert(loc = 3, column='delay_1' , value=delays['delay_1'])
data.insert(loc = 4, column='delay_2' , value=delays['delay_2'])
data.insert(loc = 5, column='delay_3' , value=delays['delay_3'])
data

       From         To  ... FlightNumber              Airline
0    London      Paris  ...      10045.0               KLM(!)
1    Madrid      Milan  ...          NaN    <Air France> (12)
2    London  Stockholm  ...      10065.0  (British Airways. )
3  Budapest      Paris  ...          NaN       12. Air France
4  Brussels     London  ...      10085.0          "Swiss Air"

[5 rows x 8 columns]